Model: "sequential_10"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv1d_13 (Conv1D)          (None, 2498, 8)           56        
                                                                 
 max_pooling1d_13 (MaxPooli  (None, 1249, 8)           0         
 ng1D)                                                           
                                                                 
 flatten_10 (Flatten)        (None, 9992)              0         
                                                                 
 dense_16 (Dense)            (None, 55)                549615    
                                                                 
=================================================================
Total params: 549671 (2.10 MB)
Trainable params: 549671 (2.10 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
